# Chapter 6

In [73]:
import pandas as pd
import numpy as np

# Reading and Writing Data in Text Format

In [5]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
df= pd.read_csv('examples/ex1.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_table('examples/ex1.csv' , sep= ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [11]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [12]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
names = ['a', 'b', 'c', 'd', 'message']

In [14]:
pd.read_csv('examples/ex2.csv', names=names, index_col= 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [15]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [16]:
parsed= pd.read_csv('examples/csv_mindex.csv', index_col= ['key1', 'key2'])

In [17]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [18]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [19]:
result= pd.read_table('examples/ex3.txt', sep= '\s+')

In [20]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [21]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [22]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [26]:
result = pd.read_csv('examples/ex5.csv')

In [27]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [29]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [30]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [31]:
 pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [32]:
pd.options.display.max_rows= 10

In [35]:
result = pd.read_csv('examples/ex6.csv')

In [36]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [37]:
pd.read_csv('examples/ex6.csv' , nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [39]:
chunker= pd.read_csv('examples/ex6.csv', chunksize= 1000)

In [40]:
chunker

In [48]:
tot = pd.Series([])
for piece in chunker:
    tot= tot.add(piece['key'].value_counts(), fill_value= 0)
    
tot = tot.sort_values(ascending=False)

/var/folders/ks/wmyjpklj74bd5vsh426v1w4c0000gp/T/ipykernel_32362/801994448.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [47]:
tot[:10]

Series([], dtype: float64)

# Writing Data to Text Format

In [49]:
data = pd.read_csv('examples/ex5.csv')

In [50]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [51]:
data.to_csv('examples/out.csv')

In [52]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [53]:
import sys

In [54]:
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [55]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [56]:
data.to_csv(sys.stdout, index= False, header= False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [57]:
data.to_csv(sys.stdout, index= False, columns= ['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [58]:
dates= pd.date_range('1/1/2000' , periods=7)

In [59]:
ts= pd.Series(np.arange(7), index= dates)

In [60]:
ts.to_csv('examples/tseries.csv')

In [61]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

# Working with Delimited Formats

In [62]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [63]:
import csv

In [76]:
f = open('examples/ex7.csv')
reader= csv.reader(f)

In [79]:
for line in reader: 
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [80]:
with open('examples/ex7.csv') as f:
    lines= list(csv.reader(f))

In [81]:
header, values = lines[0], lines[1:]

In [82]:
data_dict= {h: v for h, v in zip(header, zip(*values))}

In [83]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [92]:
class my_dialect(csv.Dialect):
        lineterminator = '\n' 
        delimiter = ';'
        quotechar = '"'
        quoting = csv.QUOTE_MINIMAL

In [101]:
reader = csv.reader(f, dialect=my_dialect)

ValueError: I/O operation on closed file.

# JSON Data

JSON (short for JavaScript Object Notation) has become one of the standard formats for sending data by HTTP request between web browsers and other applications. It is a much more free-form data format than a tabular text form like CSV. Here is an example:

In [102]:
  obj = """
    {"name": "Wes",
     "places_lived": ["United States", "Spain", "Germany"],
     "pet": null,
     "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
                  {"name": "Katie", "age": 38,
                   "pets": ["Sixes", "Stache", "Cisco"]}]
} """

In [103]:
import json

In [104]:
result= json.loads(obj)

In [105]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [106]:
asjson= json.dumps(result)

In [107]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [108]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [109]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [110]:
data= pd.read_json('examples/example.json')

In [111]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [112]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [113]:
print(data.to_json(orient= 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

# XML and HTML: Web Scraping

In [116]:

pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (4.11.1)
Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 112.2/112.2 KB 2.9 MB/s eta 0:00:00a 0:00:01
Requirement already satisfied: soupsieve>1.2 in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from beautifulsoup4) (2.3.2.post1)
Requirement already satisfied: six>=1.9 in /opt/homebrew/Cellar/six/1.16.0_2/lib/python3.10/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/lib/python3.10/site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
WARNING: You are using pip version 22.0.4; however, version 22.2 is available.
You should consider upgrading via the '/opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/bin/python3.10 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [121]:
!pip3 install conda lxml

Defaulting to user installation because normal site-packages is not writeable
Collecting conda
  Using cached conda-4.3.16.tar.gz (299 kB)
  Preparing metadata (setup.py) ... done
Collecting lxml
  Using cached lxml-4.9.1.tar.gz (3.4 MB)
  Preparing metadata (setup.py) ... done
Collecting pycosat>=0.6.1
  Downloading pycosat-0.6.3.zip (66 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 66.8/66.8 kB 1.9 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Collecting requests>=2.12.4
  Downloading requests-2.28.1-py3-none-any.whl (62 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 62.8/62.8 kB 2.2 MB/s eta 0:00:00
Collecting ruamel.yaml>=0.11.14
  Downloading ruamel.yaml-0.17.21-py3-none-any.whl (109 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 109.5/109.5 kB 3.6 MB/s eta 0:00:00
Collecting urllib3<1.27,>=1.21.1
  Downloading urllib3-1.26.11-py2.py3-none-any.whl (139 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 139.9/139.9 kB 4.2 MB/s eta 0:00:00
Collecting charset-normalizer<3,>=2
  Downloading charset_normalizer-2.1.0-py3-none-any.whl (39 kB)
Collecting certifi>=2017.4.17
  Downloading certifi-2022.6.15-py3-none-any.whl (160 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 160.2/160.2 kB 4.9 MB/s eta 0:00:00
Collecting idna<4,>=2.5
  Downloading idna-3.3-py3-none-any.whl (61 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 61.2/61.2 kB 2.2 MB/s eta 0:00:00
Collecting ruamel.yaml.clib>=0.2.6
  Downloading ruamel.yaml.clib-0.2.6.tar.gz (180 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 180.7/180.7 kB 5.2 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: conda, lxml, pycosat, ruamel.yaml.clib
  Building wheel for conda (setup.py) ... done
  Created wheel for conda: filename=conda-4.3.16-py3-none-any.whl size=336938 sha256=e1923f09429d2c315330f2826c79d1ee5cfc9690824fab95de43e8681db9719f
  Stored in directory: /Users/gamze/Library/Caches/pip/wheels/6e/c5/70/e50a1a99d26cbe940549549b7601d484e0f0bc4b8f0ec49e36
  Building wheel for lxml (setup.py) ... done
  Created wheel for lxml: filename=lxml-4.9.1-cp38-cp38-macosx_10_14_arm64.whl size=3029429 sha256=38e598bc390da5f5a8e5ee0c43f2ec1c7d556a7de6f64ef3ed13cc4a2840f0ed
  Stored in directory: /Users/gamze/Library/Caches/pip/wheels/03/02/29/e73e6bd0b04b9ddb5e40fe507107c1e6e148bf8521a1964685
  Building wheel for pycosat (setup.py) ... done
  Created wheel for pycosat: filename=pycosat-0.6.3-cp38-cp38-macosx_10_14_arm64.whl size=118365 sha256=c529186246ec44425064024b77d15e35018d153fcf36b1e366ad456b8adc0f8a
  Stored in directory: /Users/gamze/Library/Caches/pip/wheels/71/5b/2d/0a9247760f0f008abc0eae7c0127a8c1cddfe1145e4b170fc0
  Building wheel for ruamel.yaml.clib (setup.py) ... done
  Created wheel for ruamel.yaml.clib: filename=ruamel.yaml.clib-0.2.6-cp38-cp38-macosx_10_14_arm64.whl size=269039 sha256=34f006db40840a6520dc876f101c4a86f54012e76639ea6cbf25821976fa1a12
  Stored in directory: /Users/gamze/Library/Caches/pip/wheels/17/0a/cb/8df6ed5547555605ad0f025f670be83ff322b3cfb5982e9427
Successfully built conda lxml pycosat ruamel.yaml.clib
Installing collected packages: pycosat, urllib3, ruamel.yaml.clib, lxml, idna, charset-normalizer, certifi, ruamel.yaml, requests, conda
  WARNING: The script normalizer is installed in '/Users/gamze/Library/Python/3.8/bin' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
  WARNING: The script conda is installed in '/Users/gamze/Library/Python/3.8/bin' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed certifi-2022.6.15 charset-normalizer-2.1.0 conda-4.3.16 idna-3.3 lxml-4.9.1 pycosat-0.6.3 requests-2.28.1 ruamel.yaml-0.17.21 ruamel.yaml.clib-0.2.6 urllib3-1.26.11

[notice] A new release of pip available: 22.1.2 -> 22.2.1
[notice] To update, run: /Applications/Xcode.app/Contents/Developer/usr/bin/python3 -m pip install --upgrade pip

In [125]:
tables= pd.read_html('examples/fdic_failed_bank_list.html')

In [127]:
len(tables)

1

In [128]:
failures= tables[0]

In [129]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [130]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [131]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

# Parsing XML with lxml.objectify

### XML (eXtensible Markup Language) is another common structured data format sup‐ porting hierarchical, nested data with metadata. The book you are currently reading was actually created from a series of large XML documents.

In [132]:
from lxml import objectify

In [138]:
path = 'examples/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()
data=[]

FileNotFoundError: [Errno 2] No such file or directory: 'examples/mta_perf/Performance_MNR.xml'

In [135]:
perf = pd.DataFrame(data)

In [136]:
perf.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [139]:
from io import StringIO

In [140]:
tag = '<a href="http://www.google.com">Google</a>' 
root = objectify.parse(StringIO(tag)).getroot()

In [141]:
root.get('href')

'http://www.google.com'

In [142]:
root.text

'Google'

## 6.2 Binary Data Formats

In [143]:
frame = pd.read_csv('examples/ex1.csv')

In [144]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [145]:
frame.to_pickle('examples/frame_pickle')

In [146]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## Using HDF5 Format

In [23]:
frame= pd.DataFrame({'a': np.random.randn(100)})

In [24]:
pip install --user tables

Collecting tables
  Using cached tables-3.7.0.tar.gz (8.2 MB)
  Installing build dependencies ... done
  Getting requirements to build wheel ... error
  error: subprocess-exited-with-error

  × Getting requirements to build wheel did not run successfully.
  │ exit code: 1
  ╰─> [12 lines of output]
      /var/folders/ks/wmyjpklj74bd5vsh426v1w4c0000gp/T/H5closege__86_d.c:2:5: error: implicit declaration of function 'H5close' is invalid in C99 [-Werror,-Wimplicit-function-declaration]
          H5close();
          ^
      1 error generated.
      cpuinfo failed, assuming no CPU features: No module named 'cpuinfo'
      * Using Python 3.10.5 (main, Jun 23 2022, 17:14:57) [Clang 13.1.6 (clang-1316.0.21.2.5)]
      * Found cython 0.29.31
      * USE_PKGCONFIG: False
      .. ERROR:: Could not find a local HDF5 installation.
         You may need to explicitly state where your local HDF5 headers and
         library can be found by setting the ``HDF5_DIR`` environment
         variable or by using the ``--hdf5`` command-line option.
      [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.
error: subprocess-exited-with-error

× Getting requirements to build wheel did not run successfully.
│ exit code: 1
╰─> See above for output.

note: This error originates from a subprocess, and is likely not a problem with pip.
Note: you may need to restart the kernel to use updated packages.

In [174]:
!/Applications/Xcode.app/Contents/Developer/usr/bin/python3 -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pip in /Users/gamze/Library/Python/3.8/lib/python/site-packages (22.1.2)
Collecting pip
  Using cached pip-22.2.1-py3-none-any.whl (2.0 MB)
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 22.1.2
    Uninstalling pip-22.1.2:
      Successfully uninstalled pip-22.1.2
  WARNING: The scripts pip, pip3 and pip3.8 are installed in '/Users/gamze/Library/Python/3.8/bin' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.
Successfully installed pip-22.2.1

In [178]:
pip install --download=/tmp -r requirements.txt

Usage:
  /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/bin/python3.10 -m pip install [options] <requirement specifier> [package-index-options] ...
  /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/bin/python3.10 -m pip install [options] -r <requirements file> [package-index-options] ...
  /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/bin/python3.10 -m pip install [options] [-e] <vcs project url> ...
  /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/bin/python3.10 -m pip install [options] [-e] <local project path> ...
  /opt/homebrew/Cellar/jupyterlab/3.4.3/libexec/bin/python3.10 -m pip install [options] <archive url/path> ...

no such option: --download
Note: you may need to restart the kernel to use updated packages.

In [26]:
conda install -c conda-forge pytables

ValueError: The python kernel does not appear to be a conda environment.  Please use ``%pip install`` instead.

# Reading Microsoft Excel Files

In [30]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [29]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.10-py2.py3-none-any.whl (242 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 242.1/242.1 kB 4.8 MB/s eta 0:00:00a 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10
Note: you may need to restart the kernel to use updated packages.

In [31]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [32]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [33]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [34]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [35]:
frame.to_excel(writer, 'Sheet1')

In [36]:
writer.save()

In [37]:
frame.to_excel('examples/ex2.xlsx')

In [38]:
import requests

In [39]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [40]:
resp= requests.get(url)

In [41]:
resp

In [42]:
data = resp.json()

In [43]:
data[0]['title']

'DOC: Add numpydoc SS06 validation'

In [44]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                       'labels', 'state'])

In [45]:
issues

,number,title,labels,state
0,47885,DOC: Add numpydoc SS06 validation,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
1,47884,Pandas string dtype needs from NumPy - prototy...,[],open
2,47883,BUG: Unexpected results when adding offsets to...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
3,47882,BUG: FutureWarning for timezone-naive date tim...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,47881,BUG: fix Dataframe.join with categorical index...,[],open
5,47880,ENH: parse 8 or 9 digit delimited dates,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
6,47879,PERF: preserve Index._id through pickle round-...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
7,47878,PERF: MultiIndex.copy(deep=False) not preservi...,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
8,47874,BUG: `to_sql` string to date and/or time conve...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
9,47872,ENH: Allow different `dtype` in `pandas.Series...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
10,47871,BUG: to_csv requires escapechar unnecessarily ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,47867,BUG: Update Values from MultiIndex Dataframe a...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,47866,ENH: Allow read_csv(engine=pyarrow) to return ...,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
13,47864,ENH: `Styler.relabel_index` for directly speci...,"[{'id': 1728592794, 'node_id': 'MDU6TGFiZWwxNz...",open
14,47862,"DEPR or DOCS: pd.value_counts() is public, b...","[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
15,47861,DOC: Plotting / Visualization without Jupyter,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
16,47860,Added improvements in to_datetime Error report...,[],open
17,47859,"ENH: DataFrame eval will not work with '""True""...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
18,47856,BUG: The `nanoseconds` in pd.DateOffset was ig...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,47854,DOC/ENH: Add documentation and whatsnew entry ...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
20,47852,ENH: Adding functionality to ignore certain co...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
21,47851,"DEPR: args and kwargs in rolling, expanding, a...","[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
22,47849,Added improvements in to_datetime Error report...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
23,47848,Fix styling of `DataFrame` for columns with bo...,"[{'id': 1728592794, 'node_id': 'MDU6TGFiZWwxNz...",open
24,47846,DOC: Clarify sorting and order of categoricals...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
25,47845,"ENH: Add more ""Offset aliases"" to Timedelta fu...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
26,47844,DOCS: series.astype return error when a dateti...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
27,47843,"Faster method of normalising dictionary, allow...",[],open
28,47841,updated the code in accordance with GH24845,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
29,47840,BUG Fixing columns dropped from multi index in...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open

In [46]:
import sqlite3

In [49]:
query= """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
         c REAL,        d INTEGER
        );"""

In [50]:
con= sqlite3.connect('mydata.sqlite')

In [51]:
con.execute(query)

In [52]:
con.commit()

In [53]:
data = [('Atlanta', 'Georgia', 1.25, 6),
             ('Tallahassee', 'Florida', 2.6, 3),
                ('Sacramento', 'California', 1.7, 5)]

In [54]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [55]:
con.executemany(stmt, data)

In [56]:
con.commit()

In [57]:
cursor = con.execute('select * from test')

In [59]:
rows = cursor.fetchall()

In [60]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [61]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [62]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [74]:
import sys
!{sys.executable} -m pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.39-cp310-cp310-macosx_10_15_universal2.whl (1.6 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 10.7 MB/s eta 0:00:00a 0:00:01
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.4.39

In [75]:
import sqlalchemy as sqla

In [76]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [77]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5